[Killed] BooleanLiteral
contexts/OnboardingContext.tsx:47:15
 const STORAGE_KEY = '@culturepass_onboarding';
 
 const defaultState: OnboardingState = {
-  isComplete: false,
+  isComplete: true,
   country: '',
   city: '',
killedBy: OnboardingContext resets onboarding state and removes persisted storage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
contexts/OnboardingContext.tsx:50:16
   isComplete: false,
   country: '',
   city: '',
-  communities: [],
+  communities: ["Stryker was here"],
   nationalityId: '',
   cultureIds: [],
killedBy: OnboardingContext uses expected default state shape when no persisted data exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ArrayDeclaration
contexts/OnboardingContext.tsx:52:15
   city: '',
   communities: [],
   nationalityId: '',
-  cultureIds: [],
+  cultureIds: ["Stryker was here"],
   languageIds: [],
   diasporaGroupIds: [],
killedBy: OnboardingContext uses expected default state shape when no persisted data exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ArrayDeclaration
contexts/OnboardingContext.tsx:54:21
   nationalityId: '',
   cultureIds: [],
   languageIds: [],
-  diasporaGroupIds: [],
+  diasporaGroupIds: ["Stryker was here"],
   ethnicityText: '',
   languages: [],
killedBy: OnboardingContext uses expected default state shape when no persisted data exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] StringLiteral
contexts/OnboardingContext.tsx:55:18
   cultureIds: [],
   languageIds: [],
   diasporaGroupIds: [],
-  ethnicityText: '',
+  ethnicityText: "Stryker was here!",
   languages: [],
   interests: [],
killedBy: OnboardingContext uses expected default state shape when no persisted data exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] ArrayDeclaration
contexts/OnboardingContext.tsx:56:14
   languageIds: [],
   diasporaGroupIds: [],
   ethnicityText: '',
-  languages: [],
+  languages: ["Stryker was here"],
   interests: [],
   subscriptionTier: 'free',
killedBy: OnboardingContext uses expected default state shape when no persisted data exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] StringLiteral
contexts/OnboardingContext.tsx:58:21
   ethnicityText: '',
   languages: [],
   interests: [],
-  subscriptionTier: 'free',
+  subscriptionTier: "",
 };
 
killedBy: OnboardingContext uses expected default state shape when no persisted data exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "free"
Received: ""

[Killed] BooleanLiteral
contexts/OnboardingContext.tsx:65:46
 
 export function OnboardingProvider({ children }: { children: ReactNode }) {
   const [state, setState] = useState<OnboardingState>(defaultState);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
 
   useEffect(() => {
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Melbourne"
Received: ""

[Killed] BlockStatement
contexts/OnboardingContext.tsx:67:19
   const [state, setState] = useState<OnboardingState>(defaultState);
   const [isLoading, setIsLoading] = useState(true);
 
-  useEffect(() => {
-    const loadData = async () => {
-      try {
-        const data = await AsyncStorage.getItem(STORAGE_KEY);
-        if (data) {
-          const parsed = JSON.parse(data) as Partial<OnboardingState>;
-          setState({ ...defaultState, ...parsed });
-        }
-      } catch {
-        // AsyncStorage unavailable (e.g. private browsing on web) — use defaults
-      } finally {
-        setIsLoading(false);
-      }
-    };
-    loadData();
-    /* Stryker disable next-line all */
-  }, []);
+  useEffect(() => {}, []);
 
   const persistUpdate = async (patch: Partial<OnboardingState>) => {
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
contexts/OnboardingContext.tsx:68:34
   const [isLoading, setIsLoading] = useState(true);
 
   useEffect(() => {
-    const loadData = async () => {
-      try {
-        const data = await AsyncStorage.getItem(STORAGE_KEY);
-        if (data) {
-          const parsed = JSON.parse(data) as Partial<OnboardingState>;
-          setState({ ...defaultState, ...parsed });
-        }
-      } catch {
-        // AsyncStorage unavailable (e.g. private browsing on web) — use defaults
-      } finally {
-        setIsLoading(false);
-      }
-    };
+    const loadData = async () => {};
     loadData();
     /* Stryker disable next-line all */
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
contexts/OnboardingContext.tsx:69:11
 
   useEffect(() => {
     const loadData = async () => {
-      try {
-        const data = await AsyncStorage.getItem(STORAGE_KEY);
-        if (data) {
-          const parsed = JSON.parse(data) as Partial<OnboardingState>;
-          setState({ ...defaultState, ...parsed });
-        }
-      } catch {
+      try {} catch {
         // AsyncStorage unavailable (e.g. private browsing on web) — use defaults
       } finally {
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Melbourne"
Received: ""

[Killed] ConditionalExpression
contexts/OnboardingContext.tsx:71:13
     const loadData = async () => {
       try {
         const data = await AsyncStorage.getItem(STORAGE_KEY);
-        if (data) {
+        if (false) {
           const parsed = JSON.parse(data) as Partial<OnboardingState>;
           setState({ ...defaultState, ...parsed });
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Melbourne"
Received: ""

[Killed] ConditionalExpression
contexts/OnboardingContext.tsx:71:13
     const loadData = async () => {
       try {
         const data = await AsyncStorage.getItem(STORAGE_KEY);
-        if (data) {
+        if (true) {
           const parsed = JSON.parse(data) as Partial<OnboardingState>;
           setState({ ...defaultState, ...parsed });
killedBy: OnboardingContext does not parse storage payload when getItem returns an empty string
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ""

[Killed] BlockStatement
contexts/OnboardingContext.tsx:77:17
         }
       } catch {
         // AsyncStorage unavailable (e.g. private browsing on web) — use defaults
-      } finally {
-        setIsLoading(false);
-      }
+      } finally {}
     };
     loadData();
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
contexts/OnboardingContext.tsx:85:68
     /* Stryker disable next-line all */
   }, []);
 
-  const persistUpdate = async (patch: Partial<OnboardingState>) => {
-    setState((prev) => {
-      const newState = { ...prev, ...patch };
-      AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {
-        if (__DEV__) {
-          console.warn('[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.', err);
-        }
-      });
-      return newState;
-    });
-  };
+  const persistUpdate = async (patch: Partial<OnboardingState>) => {};
 
   const value = useMemo(() => ({
killedBy: OnboardingContext updates location and persists the new value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Australia"
Received: ""

[Killed] BlockStatement
contexts/OnboardingContext.tsx:86:24
   }, []);
 
   const persistUpdate = async (patch: Partial<OnboardingState>) => {
-    setState((prev) => {
-      const newState = { ...prev, ...patch };
-      AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {
-        if (__DEV__) {
-          console.warn('[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.', err);
-        }
-      });
-      return newState;
-    });
+    setState((prev) => {});
   };
 
killedBy: OnboardingContext updates location and persists the new value
statusReason: TypeError: Cannot read properties of undefined (reading 'country')

[Killed] BlockStatement
contexts/OnboardingContext.tsx:88:82
   const persistUpdate = async (patch: Partial<OnboardingState>) => {
     setState((prev) => {
       const newState = { ...prev, ...patch };
-      AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {
-        if (__DEV__) {
-          console.warn('[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.', err);
-        }
-      });
+      AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {});
       return newState;
     });
killedBy: OnboardingContext warns in dev when persistence fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.", Any<Error>

Number of calls: 0

[Killed] ConditionalExpression
contexts/OnboardingContext.tsx:89:13
     setState((prev) => {
       const newState = { ...prev, ...patch };
       AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {
-        if (__DEV__) {
+        if (true) {
           console.warn('[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.', err);
         }
killedBy: OnboardingContext does not warn in production mode when persistence fails
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.", [Error: persist-failed-prod]

[Killed] ConditionalExpression
contexts/OnboardingContext.tsx:89:13
     setState((prev) => {
       const newState = { ...prev, ...patch };
       AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {
-        if (__DEV__) {
+        if (false) {
           console.warn('[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.', err);
         }
killedBy: OnboardingContext warns in dev when persistence fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.", Any<Error>

Number of calls: 0

[Killed] StringLiteral
contexts/OnboardingContext.tsx:90:24
       const newState = { ...prev, ...patch };
       AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(newState)).catch((err) => {
         if (__DEV__) {
-          console.warn('[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.', err);
+          console.warn("", err);
         }
       });
killedBy: OnboardingContext warns in dev when persistence fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[OnboardingContext] AsyncStorage.setItem failed — onboarding state will not persist across sessions.", Any<Error>
Received: "", [Error: persist-failed]

Number of calls: 1

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:97:25
     });
   };
 
-  const value = useMemo(() => ({
-    state,
-    isLoading,
-    setCountry:          (country: string) => persistUpdate({ country }),
-    setCity:             (city: string) => persistUpdate({ city }),
-    setCommunities:      (communities: string[]) => persistUpdate({ communities }),
-    setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
-    setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
-    setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
-    setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
-    setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
-    setLanguages:        (languages: string[]) => persistUpdate({ languages }),
-    setInterests:        (interests: string[]) => persistUpdate({ interests }),
-    setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
-    completeOnboarding:  () => persistUpdate({ isComplete: true }),
-    restartOnboarding:   () => persistUpdate({ isComplete: false }),
-    resetOnboarding: async () => {
-      setState(defaultState);
-      await AsyncStorage.removeItem(STORAGE_KEY).catch(() => {});
-    },
-    updateLocation: (country: string, city: string) => persistUpdate({ country, city }),
-  }), [state, isLoading]);
+  const value = useMemo(() => undefined, [state, isLoading]);
 
   return (
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: useOnboarding must be used within an OnboardingProvider

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:100:26
   const value = useMemo(() => ({
     state,
     isLoading,
-    setCountry:          (country: string) => persistUpdate({ country }),
+    setCountry:          () => undefined,
     setCity:             (city: string) => persistUpdate({ city }),
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Australia"
Received: ""

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:101:26
     state,
     isLoading,
     setCountry:          (country: string) => persistUpdate({ country }),
-    setCity:             (city: string) => persistUpdate({ city }),
+    setCity:             () => undefined,
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Brisbane"
Received: ""

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:102:26
     isLoading,
     setCountry:          (country: string) => persistUpdate({ country }),
     setCity:             (city: string) => persistUpdate({ city }),
-    setCommunities:      (communities: string[]) => persistUpdate({ communities }),
+    setCommunities:      () => undefined,
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "South Asian",
- ]

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:103:26
     setCountry:          (country: string) => persistUpdate({ country }),
     setCity:             (city: string) => persistUpdate({ city }),
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
-    setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
+    setNationalityId:    () => undefined,
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nat-au"
Received: ""

[Killed] ObjectLiteral
contexts/OnboardingContext.tsx:103:67
     setCountry:          (country: string) => persistUpdate({ country }),
     setCity:             (city: string) => persistUpdate({ city }),
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
-    setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
+    setNationalityId:    (nationalityId: string) => persistUpdate({}),
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nat-au"
Received: ""

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:104:26
     setCity:             (city: string) => persistUpdate({ city }),
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
-    setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
+    setCultureIds:       () => undefined,
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "culture-1",
-   "culture-2",

[Killed] ObjectLiteral
contexts/OnboardingContext.tsx:104:66
     setCity:             (city: string) => persistUpdate({ city }),
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
-    setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
+    setCultureIds:       (cultureIds: string[]) => persistUpdate({}),
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "culture-1",
-   "culture-2",

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:105:26
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
-    setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
+    setLanguageIds:      () => undefined,
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "en",
-   "hi",

[Killed] ObjectLiteral
contexts/OnboardingContext.tsx:105:67
     setCommunities:      (communities: string[]) => persistUpdate({ communities }),
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
-    setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
+    setLanguageIds:      (languageIds: string[]) => persistUpdate({}),
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "en",
-   "hi",

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:106:26
     setNationalityId:    (nationalityId: string) => persistUpdate({ nationalityId }),
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
-    setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
+    setDiasporaGroupIds: () => undefined,
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
     setLanguages:        (languages: string[]) => persistUpdate({ languages }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "diaspora-1",
- ]

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:107:26
     setCultureIds:       (cultureIds: string[]) => persistUpdate({ cultureIds }),
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
-    setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
+    setEthnicityText:    () => undefined,
     setLanguages:        (languages: string[]) => persistUpdate({ languages }),
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Filipino"
Received: ""

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:108:26
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
-    setLanguages:        (languages: string[]) => persistUpdate({ languages }),
+    setLanguages:        () => undefined,
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "English",
- ]

[Killed] ObjectLiteral
contexts/OnboardingContext.tsx:108:65
     setLanguageIds:      (languageIds: string[]) => persistUpdate({ languageIds }),
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
-    setLanguages:        (languages: string[]) => persistUpdate({ languages }),
+    setLanguages:        (languages: string[]) => persistUpdate({}),
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
killedBy: OnboardingContext updates all location and identity setters with persisted state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "English",
- ]

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:109:26
     setDiasporaGroupIds: (diasporaGroupIds: string[]) => persistUpdate({ diasporaGroupIds }),
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
     setLanguages:        (languages: string[]) => persistUpdate({ languages }),
-    setInterests:        (interests: string[]) => persistUpdate({ interests }),
+    setInterests:        () => undefined,
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
     completeOnboarding:  () => persistUpdate({ isComplete: true }),
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "food",
- ]

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:110:26
     setEthnicityText:    (ethnicityText: string) => persistUpdate({ ethnicityText }),
     setLanguages:        (languages: string[]) => persistUpdate({ languages }),
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
-    setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
+    setSubscriptionTier: () => undefined,
     completeOnboarding:  () => persistUpdate({ isComplete: true }),
     restartOnboarding:   () => persistUpdate({ isComplete: false }),
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "plus"
Received: "free"

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:111:26
     setLanguages:        (languages: string[]) => persistUpdate({ languages }),
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
-    completeOnboarding:  () => persistUpdate({ isComplete: true }),
+    completeOnboarding:  () => undefined,
     restartOnboarding:   () => persistUpdate({ isComplete: false }),
     resetOnboarding: async () => {
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
contexts/OnboardingContext.tsx:111:60
     setLanguages:        (languages: string[]) => persistUpdate({ languages }),
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
-    completeOnboarding:  () => persistUpdate({ isComplete: true }),
+    completeOnboarding:  () => persistUpdate({ isComplete: false }),
     restartOnboarding:   () => persistUpdate({ isComplete: false }),
     resetOnboarding: async () => {
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:112:26
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
     completeOnboarding:  () => persistUpdate({ isComplete: true }),
-    restartOnboarding:   () => persistUpdate({ isComplete: false }),
+    restartOnboarding:   () => undefined,
     resetOnboarding: async () => {
       setState(defaultState);
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
contexts/OnboardingContext.tsx:112:60
     setInterests:        (interests: string[]) => persistUpdate({ interests }),
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
     completeOnboarding:  () => persistUpdate({ isComplete: true }),
-    restartOnboarding:   () => persistUpdate({ isComplete: false }),
+    restartOnboarding:   () => persistUpdate({ isComplete: true }),
     resetOnboarding: async () => {
       setState(defaultState);
killedBy: OnboardingContext updates key profile fields via setters and onboarding completion toggles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
