[Killed] BlockStatement
contexts/OnboardingContext.tsx:113:34
     setSubscriptionTier: (subscriptionTier: OnboardingState['subscriptionTier']) => persistUpdate({ subscriptionTier }),
     completeOnboarding:  () => persistUpdate({ isComplete: true }),
     restartOnboarding:   () => persistUpdate({ isComplete: false }),
-    resetOnboarding: async () => {
-      setState(defaultState);
-      await AsyncStorage.removeItem(STORAGE_KEY).catch(() => {});
-    },
+    resetOnboarding: async () => {},
     updateLocation: (country: string, city: string) => persistUpdate({ country, city }),
   }), [state, isLoading]);
killedBy: OnboardingContext resets onboarding state and removes persisted storage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
contexts/OnboardingContext.tsx:117:21
       setState(defaultState);
       await AsyncStorage.removeItem(STORAGE_KEY).catch(() => {});
     },
-    updateLocation: (country: string, city: string) => persistUpdate({ country, city }),
+    updateLocation: () => undefined,
   }), [state, isLoading]);
 
killedBy: OnboardingContext updates location and persists the new value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Australia"
Received: ""

[Killed] BlockStatement
contexts/OnboardingContext.tsx:127:57
   );
 }
 
-export function useOnboarding(): OnboardingContextValue {
-  const context = useContext(OnboardingContext);
-  if (!context) {
-    throw new Error('useOnboarding must be used within an OnboardingProvider');
-  }
-  return context;
-}
+export function useOnboarding(): OnboardingContextValue {}
 
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: Cannot read properties of undefined (reading 'isLoading')

[Killed] BlockStatement
contexts/OnboardingContext.tsx:129:17
 
 export function useOnboarding(): OnboardingContextValue {
   const context = useContext(OnboardingContext);
-  if (!context) {
-    throw new Error('useOnboarding must be used within an OnboardingProvider');
-  }
+  if (!context) {}
   return context;
 }
killedBy: OnboardingContext throws a helpful error when hook is used outside provider
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "useOnboarding must be used within an OnboardingProvider"

Received function did not throw

[Killed] ConditionalExpression
contexts/OnboardingContext.tsx:129:7
 
 export function useOnboarding(): OnboardingContextValue {
   const context = useContext(OnboardingContext);
-  if (!context) {
+  if (true) {
     throw new Error('useOnboarding must be used within an OnboardingProvider');
   }
killedBy: OnboardingContext hydrates state from AsyncStorage on mount
statusReason: Error: useOnboarding must be used within an OnboardingProvider

[Killed] StringLiteral
contexts/OnboardingContext.tsx:130:21
 export function useOnboarding(): OnboardingContextValue {
   const context = useContext(OnboardingContext);
   if (!context) {
-    throw new Error('useOnboarding must be used within an OnboardingProvider');
+    throw new Error("");
   }
   return context;
killedBy: OnboardingContext throws a helpful error when hook is used outside provider
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "useOnboarding must be used within an OnboardingProvider"
Received message:   ""

      264 |       } else {
      265 |         stryCov_9fa48("72");
    > 266 |         throw new Error(stryMutAct_9fa48("73") ? "" : (stryCov_9fa48("73"), 'useOnboarding must be used within an OnboardingProvider'));
