[Killed] BlockStatement
hooks/useCouncil.ts:8:62
 import { api, type CouncilLgaContext } from '@/lib/api';
 import { getPostcodesByPlace } from '@shared/location/australian-postcodes';
 
-function buildCouncilParams(city?: string, country?: string) {
-  const fallbackPostcode = city ? getPostcodesByPlace(city)[0] : undefined;
-  return {
-    city: city || undefined,
-    country: country || 'Australia',
-    postcode: fallbackPostcode?.postcode,
-    suburb: fallbackPostcode?.place_name,
-    state: fallbackPostcode?.state_code,
-  };
-}
+function buildCouncilParams(city?: string, country?: string) {}
 
 /**
killedBy: useCouncil hook should pass enabled: true when authenticated
statusReason: TypeError: Cannot read properties of undefined (reading 'city')

[Killed] ConditionalExpression
hooks/useCouncil.ts:11:11
 function buildCouncilParams(city?: string, country?: string) {
   const fallbackPostcode = city ? getPostcodesByPlace(city)[0] : undefined;
   return {
-    city: city || undefined,
+    city: true,
     country: country || 'Australia',
     postcode: fallbackPostcode?.postcode,
killedBy: useCouncil hook should include the correct query key with city, postcode, and state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"queryKey": ["/api/council/my", "Sydney", 2000, "NSW"]}
Received: {"enabled": true, "queryFn": [Function anonymous], "queryKey": ["/api/council/my", true, 2000, "NSW"]}

Number of calls: 1

[Killed] ConditionalExpression
hooks/useCouncil.ts:11:11
 function buildCouncilParams(city?: string, country?: string) {
   const fallbackPostcode = city ? getPostcodesByPlace(city)[0] : undefined;
   return {
-    city: city || undefined,
+    city: false,
     country: country || 'Australia',
     postcode: fallbackPostcode?.postcode,
killedBy: useCouncil hook should include the correct query key with city, postcode, and state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"queryKey": ["/api/council/my", "Sydney", 2000, "NSW"]}
Received: {"enabled": true, "queryFn": [Function anonymous], "queryKey": ["/api/council/my", false, 2000, "NSW"]}

Number of calls: 1

[Killed] LogicalOperator
hooks/useCouncil.ts:12:14
   const fallbackPostcode = city ? getPostcodesByPlace(city)[0] : undefined;
   return {
     city: city || undefined,
-    country: country || 'Australia',
+    country: country && 'Australia',
     postcode: fallbackPostcode?.postcode,
     suburb: fallbackPostcode?.place_name,
killedBy: useCouncil hook should default country to Australia when onboarding country is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"country": "Australia"}
Received: {"city": "Sydney", "country": "", "postcode": 2000, "state": "NSW", "suburb": "Sydney"}

Number of calls: 1

[Killed] ConditionalExpression
hooks/useCouncil.ts:12:14
   const fallbackPostcode = city ? getPostcodesByPlace(city)[0] : undefined;
   return {
     city: city || undefined,
-    country: country || 'Australia',
+    country: true,
     postcode: fallbackPostcode?.postcode,
     suburb: fallbackPostcode?.place_name,
killedBy: useCouncil hook should default country to Australia when onboarding country is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"country": "Australia"}
Received: {"city": "Sydney", "country": true, "postcode": 2000, "state": "NSW", "suburb": "Sydney"}

Number of calls: 1

[Killed] OptionalChaining
hooks/useCouncil.ts:13:15
   return {
     city: city || undefined,
     country: country || 'Australia',
-    postcode: fallbackPostcode?.postcode,
+    postcode: fallbackPostcode.postcode,
     suburb: fallbackPostcode?.place_name,
     state: fallbackPostcode?.state_code,
killedBy: useCouncil hook should safely build params when city is missing
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'postcode')"

      61 |       city: stryMutAct_9fa48("78") ? city && undefined : stryMutAct_9fa48("77") ? false : stryMutAct_9fa48("76") ? true : (stryCov_9fa48("76", "77", "78"), city || undefined),
      62 |       country: stryMutAct_9fa48("81") ? country && 'Australia

[Killed] OptionalChaining
hooks/useCouncil.ts:14:13
     city: city || undefined,
     country: country || 'Australia',
     postcode: fallbackPostcode?.postcode,
-    suburb: fallbackPostcode?.place_name,
+    suburb: fallbackPostcode.place_name,
     state: fallbackPostcode?.state_code,
   };
killedBy: useCouncil hook should safely build params when city is missing
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'place_name')"

      62 |       country: stryMutAct_9fa48("81") ? country && 'Australia' : stryMutAct_9fa48("80") ? false : stryMutAct_9fa48("79") ? true : (stryCov_9fa48("79", "80", "81"), country || (stryMutAct_9fa48("82") ? "" : (stryCov_9fa48("82"), 'Australia'))),

[Killed] OptionalChaining
hooks/useCouncil.ts:15:12
     country: country || 'Australia',
     postcode: fallbackPostcode?.postcode,
     suburb: fallbackPostcode?.place_name,
-    state: fallbackPostcode?.state_code,
+    state: fallbackPostcode.state_code,
   };
 }
killedBy: useCouncil hook should safely build params when city is missing
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'state_code')"

      63 |       postcode: stryMutAct_9fa48("83") ? fallbackPostcode.postcode : (stryCov_9fa48("83"), fallbackPostcode?.postcode),
      64 |       suburb: stryMutAct_9fa48("84") ? fallbackPostcode.place_name : (stryCov_9fa48("84"), fallbackPostcode?.place_

[Killed] ArrowFunction
hooks/useCouncil.ts:29:5
   const { isAuthenticated } = useAuth();
 
   const councilParams = useMemo(
-    () => buildCouncilParams(state.city, state.country),
+    () => undefined,
     [state.city, state.country],
   );
killedBy: useCouncil hook should pass enabled: true when authenticated
statusReason: TypeError: Cannot read properties of undefined (reading 'city')

[Killed] ArrayDeclaration
hooks/useCouncil.ts:30:5
 
   const councilParams = useMemo(
     () => buildCouncilParams(state.city, state.country),
-    [state.city, state.country],
+    [],
   );
 
killedBy: useCouncil hook should recompute query key when city/country changes across renders
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    "/api/council/my",
-   "Melbourne",

[Killed] ArrowFunction
hooks/useCouncil.ts:37:14
 
   const { data, isLoading, isError, refetch } = useQuery<CouncilLgaContext | null>({
     queryKey,
-    queryFn: () => api.council.my(councilParams),
+    queryFn: () => undefined,
     enabled: isAuthenticated,
   });
killedBy: useCouncil hook should default country to Australia when onboarding country is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"country": "Australia"}

Number of calls: 0

[Killed] LogicalOperator
hooks/useCouncil.ts:41:19
     enabled: isAuthenticated,
   });
 
-  const council = data?.council ?? null;
+  const council = data?.council && null;
   const councilId = council?.id;
   const lgaCode = council?.lgaCode;
killedBy: useCouncil hook should expose council, councilId, lgaCode from LGA context
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "c1", "lgaCode": "LGA12345", "name": "City of Sydney"}
Received: null

[Killed] OptionalChaining
hooks/useCouncil.ts:41:19
     enabled: isAuthenticated,
   });
 
-  const council = data?.council ?? null;
+  const council = data.council ?? null;
   const councilId = council?.id;
   const lgaCode = council?.lgaCode;
killedBy: useCouncil hook should pass enabled: true when authenticated
statusReason: TypeError: Cannot read properties of undefined (reading 'council')

[Killed] OptionalChaining
hooks/useCouncil.ts:42:21
   });
 
   const council = data?.council ?? null;
-  const councilId = council?.id;
+  const councilId = council.id;
   const lgaCode = council?.lgaCode;
 
killedBy: useCouncil hook should pass enabled: true when authenticated
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
hooks/useCouncil.ts:43:19
 
   const council = data?.council ?? null;
   const councilId = council?.id;
-  const lgaCode = council?.lgaCode;
+  const lgaCode = council.lgaCode;
 
   const reload = async () => {
killedBy: useCouncil hook should pass enabled: true when authenticated
statusReason: TypeError: Cannot read properties of null (reading 'lgaCode')

[Killed] BlockStatement
hooks/useCouncil.ts:45:30
   const councilId = council?.id;
   const lgaCode = council?.lgaCode;
 
-  const reload = async () => {
-    await queryClient.invalidateQueries({ queryKey: ['/api/council/my'] });
-  };
+  const reload = async () => {};
 
   return {
killedBy: useCouncil hook should invalidate council query when reload is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"queryKey": ["/api/council/my"]}

Number of calls: 0

[Killed] StringLiteral
hooks/useCouncil.ts:46:54
   const lgaCode = council?.lgaCode;
 
   const reload = async () => {
-    await queryClient.invalidateQueries({ queryKey: ['/api/council/my'] });
+    await queryClient.invalidateQueries({ queryKey: [""] });
   };
 
killedBy: useCouncil hook should invalidate council query when reload is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "queryKey": Array [
-     "/api/council/my",

[Killed] ObjectLiteral
hooks/useCouncil.ts:49:10
     await queryClient.invalidateQueries({ queryKey: ['/api/council/my'] });
   };
 
-  return {
-    data,
-    council,
-    councilId,
-    lgaCode,
-    isLoading,
-    isError,
-    isAuthenticated,
-    refetch,
-    reload,
-  };
+  return {};
 }
 
killedBy: useCouncil hook should expose council, councilId, lgaCode from LGA context
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"council": {"id": "c1", "lgaCode": "LGA12345", "name": "City of Sydney"}}
Received: undefined
