[Killed] LogicalOperator
hooks/useRole.ts:41:24
   const { user, isAuthenticated, isLoading, isRestoring } = useAuth();
   
   // Set role based on hardcoded ID list or existing user role
-  let role: UserRole = (user?.role as UserRole) ?? 'user';
+  let role: UserRole = user?.role as UserRole && 'user';
   if (user?.id && SUPER_ADMIN_IDS.includes(user.id)) {
     role = 'superAdmin';
killedBy: useRole hook should return default user role and false flags when not authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user"
Received: undefined

[Killed] BlockStatement
hooks/useRole.ts:42:54
   
   // Set role based on hardcoded ID list or existing user role
   let role: UserRole = (user?.role as UserRole) ?? 'user';
-  if (user?.id && SUPER_ADMIN_IDS.includes(user.id)) {
-    role = 'superAdmin';
-  }
+  if (user?.id && SUPER_ADMIN_IDS.includes(user.id)) {}
 
   return {
killedBy: useRole hook should elevate configured user IDs to superAdmin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "superAdmin"
Received: "user"

[Killed] OptionalChaining
hooks/useRole.ts:42:7
   
   // Set role based on hardcoded ID list or existing user role
   let role: UserRole = (user?.role as UserRole) ?? 'user';
-  if (user?.id && SUPER_ADMIN_IDS.includes(user.id)) {
+  if (user.id && SUPER_ADMIN_IDS.includes(user.id)) {
     role = 'superAdmin';
   }
killedBy: useRole hook should return default user role and false flags when not authenticated
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
hooks/useRole.ts:46:10
     role = 'superAdmin';
   }
 
-  return {
-    role,
-    isAuthenticated,
-    isLoading: isLoading || isRestoring,
-    /** rank >= organizer */
-    isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
-    /** rank >= cityAdmin */
-    isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
-    /** rank >= moderator */
-    isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
-    /** rank >= admin */
-    isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
-    /** exact super admin check */
-    isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
-    /** exact role match — use for specific roles like 'business' */
-    hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
-    /** rank comparison — use for "at least" checks */
-    hasMinRole: (min: UserRole) => isAuthenticated && ROLE_RANK[role] >= ROLE_RANK[min],
-  };
+  return {};
 }
 
killedBy: useRole hook should return default user role and false flags when not authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user"
Received: undefined

[Killed] ConditionalExpression
hooks/useRole.ts:49:16
   return {
     role,
     isAuthenticated,
-    isLoading: isLoading || isRestoring,
+    isLoading: false,
     /** rank >= organizer */
     isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
killedBy: useRole hook should handle loading state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
hooks/useRole.ts:49:16
   return {
     role,
     isAuthenticated,
-    isLoading: isLoading || isRestoring,
+    isLoading: isLoading && isRestoring,
     /** rank >= organizer */
     isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
killedBy: useRole hook should handle loading state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hooks/useRole.ts:51:18
     isAuthenticated,
     isLoading: isLoading || isRestoring,
     /** rank >= organizer */
-    isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
+    isOrganizer: false,
     /** rank >= cityAdmin */
     isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
killedBy: useRole hook should correctly identify rank >= organizer
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hooks/useRole.ts:51:18
     isAuthenticated,
     isLoading: isLoading || isRestoring,
     /** rank >= organizer */
-    isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
+    isOrganizer: true,
     /** rank >= cityAdmin */
     isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
killedBy: useRole hook should return default user role and false flags when not authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
hooks/useRole.ts:53:18
     /** rank >= organizer */
     isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
     /** rank >= cityAdmin */
-    isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
+    isCityAdmin: isAuthenticated || ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
     /** rank >= moderator */
     isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
killedBy: useRole hook should identify a regular authenticated user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hooks/useRole.ts:53:18
     /** rank >= organizer */
     isOrganizer: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['organizer'],
     /** rank >= cityAdmin */
-    isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
+    isCityAdmin: false,
     /** rank >= moderator */
     isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
killedBy: useRole hook should correctly identify rank >= cityAdmin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hooks/useRole.ts:55:18
     /** rank >= cityAdmin */
     isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
     /** rank >= moderator */
-    isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
+    isModerator: false,
     /** rank >= admin */
     isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
killedBy: useRole hook should correctly identify rank >= moderator
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hooks/useRole.ts:55:18
     /** rank >= cityAdmin */
     isCityAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['cityAdmin'],
     /** rank >= moderator */
-    isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
+    isModerator: true,
     /** rank >= admin */
     isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
killedBy: useRole hook should return default user role and false flags when not authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
hooks/useRole.ts:57:14
     /** rank >= moderator */
     isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
     /** rank >= admin */
-    isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
+    isAdmin: isAuthenticated || ROLE_RANK[role] >= ROLE_RANK['admin'],
     /** exact super admin check */
     isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
killedBy: useRole hook should identify a regular authenticated user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hooks/useRole.ts:57:14
     /** rank >= moderator */
     isModerator: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['moderator'],
     /** rank >= admin */
-    isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
+    isAdmin: false,
     /** exact super admin check */
     isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
killedBy: useRole hook should correctly identify rank >= admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hooks/useRole.ts:59:19
     /** rank >= admin */
     isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
     /** exact super admin check */
-    isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
+    isSuperAdmin: true,
     /** exact role match — use for specific roles like 'business' */
     hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
killedBy: useRole hook should not mark regular admin as superAdmin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hooks/useRole.ts:59:19
     /** rank >= admin */
     isAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['admin'],
     /** exact super admin check */
-    isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
+    isSuperAdmin: false,
     /** exact role match — use for specific roles like 'business' */
     hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
killedBy: useRole hook should elevate configured user IDs to superAdmin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hooks/useRole.ts:61:40
     /** exact super admin check */
     isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
     /** exact role match — use for specific roles like 'business' */
-    hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
+    hasRole: (...roles: UserRole[]) => false,
     /** rank comparison — use for "at least" checks */
     hasMinRole: (min: UserRole) => isAuthenticated && ROLE_RANK[role] >= ROLE_RANK[min],
killedBy: useRole hook hasRole should return true for exact role matches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
hooks/useRole.ts:61:14
     /** exact super admin check */
     isSuperAdmin: isAuthenticated && ROLE_RANK[role] >= ROLE_RANK['superAdmin'],
     /** exact role match — use for specific roles like 'business' */
-    hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
+    hasRole: () => undefined,
     /** rank comparison — use for "at least" checks */
     hasMinRole: (min: UserRole) => isAuthenticated && ROLE_RANK[role] >= ROLE_RANK[min],
killedBy: useRole hook hasRole should return true for exact role matches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
hooks/useRole.ts:63:36
     /** exact role match — use for specific roles like 'business' */
     hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
     /** rank comparison — use for "at least" checks */
-    hasMinRole: (min: UserRole) => isAuthenticated && ROLE_RANK[role] >= ROLE_RANK[min],
+    hasMinRole: (min: UserRole) => isAuthenticated || ROLE_RANK[role] >= ROLE_RANK[min],
   };
 }
killedBy: useRole hook hasMinRole should correctly compare ranks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
hooks/useRole.ts:63:55
     /** exact role match — use for specific roles like 'business' */
     hasRole: (...roles: UserRole[]) => isAuthenticated && roles.includes(role),
     /** rank comparison — use for "at least" checks */
-    hasMinRole: (min: UserRole) => isAuthenticated && ROLE_RANK[role] >= ROLE_RANK[min],
+    hasMinRole: (min: UserRole) => isAuthenticated && ROLE_RANK[role] > ROLE_RANK[min],
   };
 }
killedBy: useRole hook hasMinRole should correctly compare ranks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
